In [2]:
try:
    file=open('daves.csv','x')
    file.close()
except:
    print('file is already presnt')

file is already presnt

In [ ]:
#to read excel file not csv file :
import pandas as pd 
df = pd.read_excel('Book1.xlsx')
df

In [5]:
import csv
data = [['name','age','add'],
        ['Ram',45,'Kathmandu'],
       ['Shyam',34,'Bhaktapur'],
       ['Hari',34,'Lalitpur']]
file = open('daves.csv','w')
x=csv.writer(file)
x.writerows(data)
file.close()

In [7]:
import pandas as pd
df =pd.read_csv('daves.csv')
df

    name  age        add
0    Ram   45  Kathmandu
1  Shyam   34  Bhaktapur
2   Hari   34   Lalitpur

In [9]:
df = pd.read_csv('daves.csv',nrows=2)
df

    name  age        add
0    Ram   45  Kathmandu
1  Shyam   34  Bhaktapur

In [15]:
df=pd.read_csv('daves.csv',index_col='add')
df

            name  age
add
Kathmandu    Ram   45
Bhaktapur  Shyam   34
Lalitpur    Hari   34

In [21]:
df=pd.read_csv('daves.csv',index_col='add')
df.head(3)

            name  age
add
Kathmandu    Ram   45
Bhaktapur  Shyam   34
Lalitpur    Hari   34

In [23]:
df=pd.read_csv('daves.csv')
df.tail(2)

    name  age        add
1  Shyam   34  Bhaktapur
2   Hari   34   Lalitpur

In [34]:
df=pd.read_csv('daves.csv')
df.loc[1:3]

    name  age        add
1  Shyam   34  Bhaktapur
2   Hari   34   Lalitpur

In [55]:
df=pd.read_csv('daves.csv',index_col='sn')
df[df['age'] ==34]

     name  age        add
sn
2   Shyam   34  Bhaktapur
3    Hari   34   Lalitpur

In [64]:
df=pd.read_csv('daves.csv',index_col="sn")
df[(df['age']==34) &(df['add']=='Lalitpur')]

    name  age       add
sn
3   Hari   34  Lalitpur

In [65]:
import pandas as pd
# list inside dict
data = {'name':['Ram','Shyam','Hari','Sita','Gita'],
       'age':[23,45,67,89,43],
       'add':['Kathmandu','Bara','Jhapa','Bhaktapur','Lalitpur']}
df = pd.DataFrame(data)
df.to_csv('new_data.csv')
df

    name  age        add
0    Ram   23  Kathmandu
1  Shyam   45       Bara
2   Hari   67      Jhapa
3   Sita   89  Bhaktapur
4   Gita   43   Lalitpur